app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate(page: params[:page], per_page: 10)
---
SELECT  "orders".* FROM "orders" LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "orders"

  def edit
    @order = Order.find(params[:id])
    @order_status = OrderStatus.all.map{|c| [ c.name, c.id ] }
    @user = User.find(@order.user_id)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "order_statuses".* FROM "order_statuses"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @order = Order.find(params[:id])
    if @order.update_attributes(user_params)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "orders" SET "order_status_id" = ?, "user_id" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status_id", 2], ["user_id", 3], ["updated_at", "2018-02-14 12:48:48.469667"], ["id", 1]]

  def destroy
    Order.find(params[:id]).destroy
---
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]