app/controllers/order_items_controller.rb

  def create
    @order = current_order
    @order_item = @order.order_items.new(order_item_params)
    @order.save
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
INSERT INTO "order_items" ("product_id", "order_id", "unit_price", "quantity", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["product_id", 2], ["order_id", 1], ["unit_price", 20.5], ["quantity", 1], ["total_price", 20.5], ["created_at", "2018-02-08 14:30:30.541750"], ["updated_at", "2018-02-08 14:30:30.541750"]]
INSERT INTO "orders" ("subtotal", "order_status_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["subtotal", 20.5], ["order_status_id", 1], ["created_at", "2018-02-08 14:30:30.523540"], ["updated_at", "2018-02-08 14:30:30.523540"]]

  def update
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.update_attributes(order_item_params)
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 1], ["id", 3], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "order_items" SET "quantity" = ?, "total_price" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["quantity", 3], ["total_price", 307.5], ["updated_at", "2018-02-08 18:07:38.129168"], ["id", 3]]

  def destroy
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.destroy
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 1]]