app/controllers/products_controller.rb

  def index
    @products = Product.paginate(page: params[:page], per_page: 10)
---
SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "products"

  def index_category
    if params[:category_id] < 1
      @products = Product.all
    else
      @category = Category.find(params[:category_id])
      @products = Product.where(category_id: @category.id).paginate(page: params[:page], per_page: 9)
    end
    @order_item = current_order.order_items.new
---
SELECT "products".* FROM "products"
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."category_id" = ?  [["category_id", "1"]]
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = ?  [["category_id", "1"]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]

  def new
    @product = Product.new
    @categories = Category.all.map{|c| [ c.name, c.id ] }
---
SELECT "categories".* FROM "categories"

  def update
    @product.category_id = params[:category_id]
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "category_id" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["category_id", "1"], ["price", 123.4], ["updated_at", "2018-02-09 14:47:53.934704"], ["id", 1]]