app/controllers/static_pages_controller.rb

SELECT "products".* FROM "products" WHERE "products"."featured" = ?  [["featured", "t"]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
  def home
    @products = Product.where(featured: true)
    @order_item = current_order.order_items.new