app/views/categories/all.html.erb

SELECT "products".* FROM "products"
---
<h3> Products under this category </h3>
	<% Product.all.each do |product| %>