app/views/layouts/_cart_text.html.erb

<%= link_to "#{pluralize(current_order.order_items.size, 'Item')} - #{number_to_currency current_order.subtotal}", cart_path, { :class=>"cart-text" } %>
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]